# NumberForScale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayLegendSettings..::..NumberForScale Property
AnalysisDisplayLegendSettings Class See Also
---
A fixed value to display on the legend scale (0 by default; 0 means width of legend scale is calculated dynamically).
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double NumberForScale { get; set; }
```

Visual Basic
---
```text
Public Property NumberForScale As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double NumberForScale {
	double get ();
	void set (double value);
}
```

# See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace